burakenez/gd32e51x-demo-suites-cmake-vscode/Drivers/GD32E51x_standard_peripheral/Source/gd32e51x_can.c
/*!
    \file    gd32e51x_can.c
    \brief   CAN driver

    \version 2024-12-30, V1.2.0, firmware for GD32E51x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32e51x_can.h"
#include <stdlib.h>

#ifndef GD32EPRTxxA

#define CAN_ERROR_HANDLE(s)     do{}while(1)

/* This table can be used to calculate data length in FD mode */
const uint8_t g_can_fdlength_table[] = {12, 16, 20, 24, 32, 48, 64};

/*!
    \brief      deinitialize CAN
    \param[in]  can_periph
    \arg        CANx(x=0,1,2),the CAN2 only for GD32E51X_CL and GD32E518
    \param[out] none
    \retval     none
*/
void can_deinit(uint32_t can_periph)
{
#if defined(GD32E51X_CL) || defined(GD32E518)
    switch(can_periph) {
    case CAN0:
        rcu_periph_reset_enable(RCU_CAN0RST);
        rcu_periph_reset_disable(RCU_CAN0RST);
        break;
    case CAN1:
        rcu_periph_reset_enable(RCU_CAN1RST);
        rcu_periph_reset_disable(RCU_CAN1RST);
        break;
    case CAN2:
        rcu_periph_reset_enable(RCU_CAN2RST);
        rcu_periph_reset_disable(RCU_CAN2RST);
        break;
    default:
        break;
    }
#else
    switch(can_periph) {
    case CAN0:
        rcu_periph_reset_enable(RCU_CAN0RST);
        rcu_periph_reset_disable(RCU_CAN0RST);
        break;
    case CAN1:
        rcu_periph_reset_enable(RCU_CAN1RST);
        rcu_periph_reset_disable(RCU_CAN1RST);
        break;
    default:
        break;
    }
#endif
}

/*!
    \brief      initialize CAN parameter struct
    \param[in]  type: the type of CAN parameter struct
                only one parameter can be selected which is shown as below:
      \arg        CAN_INIT_STRUCT: the CAN initial struct
      \arg        CAN_FILTER_STRUCT: the CAN filter struct
      \arg        CAN_FD_FRAME_STRUCT: the CAN FD initial struct
      \arg        CAN_TX_MESSAGE_STRUCT: the CAN TX message struct
      \arg        CAN_RX_MESSAGE_STRUCT: the CAN RX message struct
    \param[in]  p_struct: the pointer of the specific struct
    \param[out] none
    \retval     none
*/
void can_struct_para_init(can_struct_type_enum type, void *p_struct)
{
    uint8_t i;

    if(NULL == p_struct) {
        CAN_ERROR_HANDLE("struct parameter can not be NULL \r\n");
    }
    /* get type of the struct */
    switch(type) {
    /* used for can_init() */
    case CAN_INIT_STRUCT:
        ((can_parameter_struct *)p_struct)->auto_bus_off_recovery = DISABLE;
        ((can_parameter_struct *)p_struct)->auto_retrans = DISABLE;
        ((can_parameter_struct *)p_struct)->auto_wake_up = DISABLE;
        ((can_parameter_struct *)p_struct)->prescaler = 0x0400U;
        ((can_parameter_struct *)p_struct)->rec_fifo_overwrite = DISABLE;
        ((can_parameter_struct *)p_struct)->resync_jump_width = CAN_BT_SJW_1TQ;
        ((can_parameter_struct *)p_struct)->time_segment_1 = CAN_BT_BS1_3TQ;
        ((can_parameter_struct *)p_struct)->time_segment_2 = CAN_BT_BS2_1TQ;
        ((can_parameter_struct *)p_struct)->time_triggered = DISABLE;
        ((can_parameter_struct *)p_struct)->trans_fifo_order = DISABLE;
        ((can_parameter_struct *)p_struct)->working_mode = CAN_NORMAL_MODE;
        break;
    /* used for can_filter_init() */
    case CAN_FILTER_STRUCT:
        ((can_filter_parameter_struct *)p_struct)->filter_bits = CAN_FILTERBITS_32BIT;
        ((can_filter_parameter_struct *)p_struct)->filter_enable = DISABLE;
        ((can_filter_parameter_struct *)p_struct)->filter_fifo_number = CAN_FIFO0;
        ((can_filter_parameter_struct *)p_struct)->filter_list_high = 0x0000U;
        ((can_filter_parameter_struct *)p_struct)->filter_list_low = 0x0000U;
        ((can_filter_parameter_struct *)p_struct)->filter_mask_high = 0x0000U;
        ((can_filter_parameter_struct *)p_struct)->filter_mask_low = 0x0000U;
        ((can_filter_parameter_struct *)p_struct)->filter_mode = CAN_FILTERMODE_MASK;
        ((can_filter_parameter_struct *)p_struct)->filter_number = 0U;
        break;
#ifdef GD32E518
    /* used for can_fd_init() */
    case CAN_FD_FRAME_STRUCT:
        ((can_fdframe_struct *)p_struct)->data_prescaler = 0x0400U;
        ((can_fdframe_struct *)p_struct)->data_resync_jump_width = 1U - 1U;
        ((can_fdframe_struct *)p_struct)->data_time_segment_1 = 3U - 1U;
        ((can_fdframe_struct *)p_struct)->data_time_segment_2 = 2U - 1U;
        ((can_fdframe_struct *)p_struct)->delay_compensation = DISABLE;
        ((can_fdframe_struct *)p_struct)->esi_mode = CAN_ESIMOD_HARDWARE;
        ((can_fdframe_struct *)p_struct)->excp_event_detect = ENABLE;
        ((can_fdframe_struct *)p_struct)->fd_frame = DISABLE;
        ((can_fdframe_struct *)p_struct)->iso_bosch = CAN_FDMOD_ISO;
        ((can_fdframe_struct *)p_struct)->p_delay_compensation = 0U;
        break;
    /* used for can_message_transmit() */
    case CAN_TX_MESSAGE_STRUCT:
        ((can_trasnmit_message_struct *)p_struct)->fd_brs = CAN_BRS_DISABLE;
        ((can_trasnmit_message_struct *)p_struct)->fd_esi = CAN_ESI_DOMINANT;
        ((can_trasnmit_message_struct *)p_struct)->fd_flag = CAN_FDF_CLASSIC;

        for(i = 0U; i < 64U; i++) {
            ((can_trasnmit_message_struct *)p_struct)->tx_data[i] = 0U;
        }

        ((can_trasnmit_message_struct *)p_struct)->tx_dlen = 0u;
        ((can_trasnmit_message_struct *)p_struct)->tx_efid = 0U;
        ((can_trasnmit_message_struct *)p_struct)->tx_ff = (uint8_t)CAN_FF_STANDARD;
        ((can_trasnmit_message_struct *)p_struct)->tx_ft = (uint8_t)CAN_FT_DATA;
        ((can_trasnmit_message_struct *)p_struct)->tx_sfid = 0U;
        break;
    /* used for can_message_receive() */
    case CAN_RX_MESSAGE_STRUCT:
        ((can_receive_message_struct *)p_struct)->fd_brs = CAN_BRS_DISABLE;
        ((can_receive_message_struct *)p_struct)->fd_esi = CAN_ESI_DOMINANT;
        ((can_receive_message_struct *)p_struct)->fd_flag = CAN_FDF_CLASSIC;

        for(i = 0U; i < 64U; i++) {
            ((can_receive_message_struct *)p_struct)->rx_data[i] = 0U;
        }

        ((can_receive_message_struct *)p_struct)->rx_dlen = 0U;
        ((can_receive_message_struct *)p_struct)->rx_efid = 0U;
        ((can_receive_message_struct *)p_struct)->rx_ff = (uint8_t)CAN_FF_STANDARD;
        ((can_receive_message_struct *)p_struct)->rx_fi = 0U;
        ((can_receive_message_struct *)p_struct)->rx_ft = (uint8_t)CAN_FT_DATA;
        ((can_receive_message_struct *)p_struct)->rx_sfid = 0U;
        break;
#else
    /* used for can_message_transmit() */
    case CAN_TX_MESSAGE_STRUCT:
        for(i = 0U; i < 8U; i++) {
            ((can_trasnmit_message_struct *)p_struct)->tx_data[i] = 0U;
        }

        ((can_trasnmit_message_struct *)p_struct)->tx_dlen = 0u;
        ((can_trasnmit_message_struct *)p_struct)->tx_efid = 0U;
        ((can_trasnmit_message_struct *)p_struct)->tx_ff = (uint8_t)CAN_FF_STANDARD;
        ((can_trasnmit_message_struct *)p_struct)->tx_ft = (uint8_t)CAN_FT_DATA;
        ((can_trasnmit_message_struct *)p_struct)->tx_sfid = 0U;
        break;
    /* used for can_message_receive() */
    case CAN_RX_MESSAGE_STRUCT:
        for(i = 0U; i < 8U; i++) {
            ((can_receive_message_struct *)p_struct)->rx_data[i] = 0U;
        }

        ((can_receive_message_struct *)p_struct)->rx_dlen = 0U;
        ((can_receive_message_struct *)p_struct)->rx_efid = 0U;
        ((can_receive_message_struct *)p_struct)->rx_ff = (uint8_t)CAN_FF_STANDARD;
        ((can_receive_message_struct *)p_struct)->rx_fi = 0U;
        ((can_receive_message_struct *)p_struct)->rx_ft = (uint8_t)CAN_FT_DATA;
        ((can_receive_message_struct *)p_struct)->rx_sfid = 0U;
        break;

#endif /* GD32E518 */
    default:
        CAN_ERROR_HANDLE("parameter is invalid \r\n");
        break;
    }
}

/*!
    \brief      initialize CAN
    \param[in]  can_periph
      \arg        CANx(x=0,1,2),the CAN2 only for GD32E51X_CL and GD32E518
    \param[in]  can_parameter_init: parameters for CAN initializtion
      \arg        working_mode: CAN_NORMAL_MODE, CAN_LOOPBACK_MODE, CAN_SILENT_MODE, CAN_SILENT_LOOPBACK_MODE
      \arg        resync_jump_width: 0x00 - 0x07
      \arg        time_segment_1: 0x00 - 0x7F
      \arg        time_segment_2: 0x00 - 0x1F
      \arg        time_triggered: ENABLE or DISABLE
      \arg        auto_bus_off_recovery: ENABLE or DISABLE
      \arg        auto_wake_up: ENABLE or DISABLE
      \arg        auto_retrans: ENABLE or DISABLE
      \arg        rec_fifo_overwrite: ENABLE or DISABLE
      \arg        trans_fifo_order: ENABLE or DISABLE
      \arg        prescaler: 0x0001 - 0x0400
    \param[out] none
    \retval     ErrStatus: SUCCESS or ERROR
*/
ErrStatus can_init(uint32_t can_periph, can_parameter_struct *can_parameter_init)
{
    uint32_t timeout = CAN_TIMEOUT;
    ErrStatus flag = ERROR;
#ifdef GD32E518
    uint32_t fdctl_status;
#endif /* GD32E518 */

    /* disable sleep mode */
    CAN_CTL(can_periph) &= ~CAN_CTL_SLPWMOD;
    /* enable initialize mode */
    CAN_CTL(can_periph) |= CAN_CTL_IWMOD;
    /* wait ACK */
    while((CAN_STAT_IWS != (CAN_STAT(can_periph) & CAN_STAT_IWS)) && (0U != timeout)) {
        timeout--;
    }
    /* check initialize working success */
    if(CAN_STAT_IWS != (CAN_STAT(can_periph) & CAN_STAT_IWS)) {
        flag = ERROR;
    } else {
#ifdef GD32E518
        /* set the bit timing register */
        fdctl_status = CAN_FDCTL(can_periph);
        if(CAN_FDCTL_FDEN != (fdctl_status & CAN_FDCTL_FDEN)) {
            /* CAN FD disable, should frist enable, then write */
            fdctl_status = fdctl_status | CAN_FDCTL_FDEN;
            CAN_FDCTL(can_periph) = fdctl_status;
            CAN_BT(can_periph) = (BT_MODE((uint32_t)can_parameter_init->working_mode) | \
                                  BT_SJW((uint32_t)can_parameter_init->resync_jump_width) | \
                                  BT_BS1((uint32_t)can_parameter_init->time_segment_1) | \
                                  BT_BS2((uint32_t)can_parameter_init->time_segment_2) | \
                                  BT_BAUDPSC(((uint32_t)(can_parameter_init->prescaler) - 1U)));
            fdctl_status = fdctl_status & (~CAN_FDCTL_FDEN);
            CAN_FDCTL(can_periph) = fdctl_status;
        } else {
            /* CAN FD enable */
            CAN_BT(can_periph) = (BT_MODE((uint32_t)can_parameter_init->working_mode) | \
                                  BT_SJW((uint32_t)can_parameter_init->resync_jump_width) | \
                                  BT_BS1((uint32_t)can_parameter_init->time_segment_1) | \
                                  BT_BS2((uint32_t)can_parameter_init->time_segment_2) | \
                                  BT_BAUDPSC(((uint32_t)(can_parameter_init->prescaler) - 1U)));
        }
#else
        /* set the bit timing register */
        CAN_BT(can_periph) = (BT_MODE((uint32_t)can_parameter_init->working_mode) | \
                              BT_SJW((uint32_t)can_parameter_init->resync_jump_width) | \
                              BT_BS1((uint32_t)can_parameter_init->time_segment_1) | \
                              BT_BS2((uint32_t)can_parameter_init->time_segment_2) | \
                              BT_BAUDPSC(((uint32_t)(can_parameter_init->prescaler) - 1U)));

#endif /* GD32E518 */
        /* time trigger communication mode */
        if(ENABLE == can_parameter_init->time_triggered) {
            CAN_CTL(can_periph) |= CAN_CTL_TTC;
        } else {
            CAN_CTL(can_periph) &= ~CAN_CTL_TTC;
        }
        /* automatic bus-off managment */
        if(ENABLE == can_parameter_init->auto_bus_off_recovery) {
            CAN_CTL(can_periph) |= CAN_CTL_ABOR;
        } else {
            CAN_CTL(can_periph) &= ~CAN_CTL_ABOR;
        }
        /* automatic wakeup mode */
        if(ENABLE == can_parameter_init->auto_wake_up) {
            CAN_CTL(can_periph) |= CAN_CTL_AWU;
        } else {
            CAN_CTL(can_periph) &= ~CAN_CTL_AWU;
        }
        /* automatic retransmission mode */
        if(ENABLE == can_parameter_init->auto_retrans) {
            CAN_CTL(can_periph) &= ~CAN_CTL_ARD;
        } else {
            CAN_CTL(can_periph) |= CAN_CTL_ARD;
        }
        /* receive fifo overwrite mode */
        if(ENABLE == can_parameter_init->rec_fifo_overwrite) {
            CAN_CTL(can_periph) &= ~CAN_CTL_RFOD;
        } else {
            CAN_CTL(can_periph) |= CAN_CTL_RFOD;
        }
        /* transmit fifo order */
        if(ENABLE == can_parameter_init->trans_fifo_order) {
            CAN_CTL(can_periph) |= CAN_CTL_TFO;
        } else {
            CAN_CTL(can_periph) &= ~CAN_CTL_TFO;
        }
        /* disable initialize mode */
        CAN_CTL(can_periph) &= ~CAN_CTL_IWMOD;
        timeout = CAN_TIMEOUT;
        /* wait the ACK */
        while((CAN_STAT_IWS == (CAN_STAT(can_periph) & CAN_STAT_IWS)) && (0U != timeout)) {
            timeout--;
        }
        /* check exit initialize mode */
        if(0U != timeout) {
            flag = SUCCESS;
        }
    }
    return flag;
}

/*!
    \brief      initialize CAN filter
    \param[in]  can_periph
      \arg        CANx(x=0,1,2),the CAN2 only for GD32E51X_CL and GD32E518
    \param[in]  can_filter_parameter_init: struct for CAN filter initialization
      \arg        filter_list_high: 0x0000 - 0xFFFF
      \arg        filter_list_low: 0x0000 - 0xFFFF
      \arg        filter_mask_high: 0x0000 - 0xFFFF
      \arg        filter_mask_low: 0x0000 - 0xFFFF
      \arg        filter_fifo_number: CAN_FIFO0, CAN_FIFO1
      \arg        filter_number: In CAN0(0 - 27), In CAN2(0 - 14)
      \arg        filter_mode: CAN_FILTERMODE_MASK, CAN_FILTERMODE_LIST
      \arg        filter_bits: CAN_FILTERBITS_32BIT, CAN_FILTERBITS_16BIT
      \arg        filter_enable: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void can_filter_init(uint32_t can_periph, can_filter_parameter_struct *can_filter_parameter_init)
{
    uint32_t val = 0U;

    val = ((uint32_t)1) << (can_filter_parameter_init->filter_number);
    if(CAN1 == can_periph) {
        can_periph = CAN0;
    }
    /* filter lock disable */
    CAN_FCTL(can_periph) |= CAN_FCTL_FLD;
    /* disable filter */
    CAN_FW(can_periph) &= ~(uint32_t)val;

    /* filter 16 bits */
    if(CAN_FILTERBITS_16BIT == can_filter_parameter_init->filter_bits) {
        /* set filter 16 bits */
        CAN_FSCFG(can_periph) &= ~(uint32_t)val;
        /* first 16 bits list and first 16 bits mask or first 16 bits list and second 16 bits list */
        CAN_FDATA0(can_periph, can_filter_parameter_init->filter_number) = \
                FDATA_MASK_HIGH((can_filter_parameter_init->filter_mask_low) & CAN_FILTER_MASK_16BITS) | \
                FDATA_MASK_LOW((can_filter_parameter_init->filter_list_low) & CAN_FILTER_MASK_16BITS);
        /* second 16 bits list and second 16 bits mask or third 16 bits list and fourth 16 bits list */
        CAN_FDATA1(can_periph, can_filter_parameter_init->filter_number) = \
                FDATA_MASK_HIGH((can_filter_parameter_init->filter_mask_high) & CAN_FILTER_MASK_16BITS) | \
                FDATA_MASK_LOW((can_filter_parameter_init->filter_list_high) & CAN_FILTER_MASK_16BITS);
    }
    /* filter 32 bits */
    if(CAN_FILTERBITS_32BIT == can_filter_parameter_init->filter_bits) {
        /* set filter 32 bits */
        CAN_FSCFG(can_periph) |= (uint32_t)val;
        /* 32 bits list or first 32 bits list */
        CAN_FDATA0(can_periph, can_filter_parameter_init->filter_number) = \
                FDATA_MASK_HIGH((can_filter_parameter_init->filter_list_high) & CAN_FILTER_MASK_16BITS) |
                FDATA_MASK_LOW((can_filter_parameter_init->filter_list_low) & CAN_FILTER_MASK_16BITS);
        /* 32 bits mask or second 32 bits list */
        CAN_FDATA1(can_periph, can_filter_parameter_init->filter_number) = \
                FDATA_MASK_HIGH((can_filter_parameter_init->filter_mask_high) & CAN_FILTER_MASK_16BITS) |
                FDATA_MASK_LOW((can_filter_parameter_init->filter_mask_low) & CAN_FILTER_MASK_16BITS);
    }

    /* filter mode */
    if(CAN_FILTERMODE_MASK == can_filter_parameter_init->filter_mode) {
        /* mask mode */
        CAN_FMCFG(can_periph) &= ~(uint32_t)val;
    } else {
        /* list mode */
        CAN_FMCFG(can_periph) |= (uint32_t)val;
    }

    /* filter FIFO */
    if(CAN_FIFO0 == (can_filter_parameter_init->filter_fifo_number)) {
        /* FIFO0 */
        CAN_FAFIFO(can_periph) &= ~(uint32_t)val;
    } else {
        /* FIFO1 */
        CAN_FAFIFO(can_periph) |= (uint32_t)val;
    }

    /* filter working */
    if(ENABLE == can_filter_parameter_init->filter_enable) {

        CAN_FW(can_periph) |= (uint32_t)val;
    }

    /* filter lock enable */
    CAN_FCTL(can_periph) &= ~CAN_FCTL_FLD;
}

/*!
    \brief      CAN filter mask mode initialization
    \param[in]  can_periph
      \arg        CANx(x=0,1,2),the CAN2 only for GD32E51X_CL and GD32E518
    \param[in]  id: extended(11-bits) or standard(29-bits) identifier
      \arg        0x00000000 - 0x1FFFFFFF
    \param[in]  mask: extended(11-bits) or standard(29-bits) identifier mask
      \arg        0x00000000 - 0x1FFFFFFF
    \param[in]  format_fifo: format and fifo states
                only one parameter can be selected which is shown as below:
      \arg        CAN_STANDARD_FIFO0
      \arg        CAN_STANDARD_FIFO1
      \arg        CAN_EXTENDED_FIFO0
      \arg        CAN_EXTENDED_FIFO1
    \param[in]  filter_number: filter sequence number
      \arg        In CAN0:0 - 27 ,In CAN2:0 - 14
    \param[out] none
    \retval     none
*/
void can_filter_mask_mode_init(uint32_t can_periph, uint32_t id, uint32_t mask, can_format_fifo_enum format_fifo, uint16_t filter_number)
{
    can_filter_parameter_struct can_filter;

    /* Initialize the filter structure */
    can_struct_para_init(CAN_FILTER_STRUCT, &can_filter);
    if(CAN1 == can_periph) {
        can_periph = CAN0;
    }
    /* filter config */
    can_filter.filter_number = filter_number;
    can_filter.filter_mode = CAN_FILTERMODE_MASK;
    can_filter.filter_bits = CAN_FILTERBITS_32BIT;
    can_filter.filter_enable = ENABLE;

    switch(format_fifo) {
    /* standard FIFO 0 */
    case CAN_STANDARD_FIFO0:
        can_filter.filter_fifo_number = CAN_FIFO0;
        /* configure SFID[10:0] */
        can_filter.filter_list_high = (uint16_t)id << 5;
        can_filter.filter_list_low = 0x0000U;
        /* configure SFID[10:0] mask */
        can_filter.filter_mask_high = (uint16_t)mask << 5;
        /* both data and remote frames can be received */
        can_filter.filter_mask_low = (uint16_t)(1U << 2U);

        break;
    /* standard FIFO 1 */
    case CAN_STANDARD_FIFO1:
        can_filter.filter_fifo_number = CAN_FIFO1;
        /* configure SFID[10:0] */
        can_filter.filter_list_high = (uint16_t)id << 5;
        can_filter.filter_list_low =  0x0000U;
        /* configure SFID[10:0] mask */
        can_filter.filter_mask_high = (uint16_t)mask << 5;
        /* both data and remote frames can be received */
        can_filter.filter_mask_low = (uint16_t)(1U << 2U);;

        break;
    /* extended FIFO 0 */
    case CAN_EXTENDED_FIFO0:
        can_filter.filter_fifo_number = CAN_FIFO0;
        /* configure EFID[28:13] */
        can_filter.filter_list_high = (uint16_t)(id >> 13);
        /* configure EFID[12:0] and frame format bit set */
        can_filter.filter_list_low = ((uint16_t)(id << 3)) | (1U << 2);
        /* configure EFID[28:13] mask */
        can_filter.filter_mask_high = (uint16_t)(mask >> 13);
        /* configure EFID[12:0] and frame format bit mask */
        /* both data and remote frames can be received */
        can_filter.filter_mask_low = ((uint16_t)(mask << 3)) | (1U << 2);

        break;
    /* extended FIFO 1 */
    case CAN_EXTENDED_FIFO1:
        can_filter.filter_fifo_number = CAN_FIFO1;
        /* configure EFID[28:13] */
        can_filter.filter_list_high = (uint16_t)(id >> 13);
        /* configure EFID[12:0] and frame format bit set */
        can_filter.filter_list_low = ((uint16_t)(id << 3)) | (1U << 2);
        /* configure EFID[28:13] mask */
        can_filter.filter_mask_high = (uint16_t)(mask >> 13);
        /* configure EFID[12:0] and frame format bit mask */
        /* both data and remote frames can be received */
        can_filter.filter_mask_low = ((uint16_t)(mask << 3)) | (1U << 2);

        break;
    default:
        CAN_ERROR_HANDLE("parameter is invalid \r\n");
    }

